posts/2015-12-09-religion-and-culture.org
#+date: <2015-12-09>
#+filetags: religion
#+title: Religion and Culture

[[http://www.booksandculture.com/articles/webexclusives/2015/december/paris-and-beyond.html?utm_source=booksandculture-html&utm_medium=Newsletter&utm_term=11172719&utm_content=401372051&utm_campaign=2013][Philip Yancey]] relates an insightful comment by a Muslim scholar explaining the particular difficulties that Islam and Christianity each have relating to culture:

#+begin_quote
I have read the entire Koran and can find in it no guidance on how Muslims should live as a minority in a society. I have read the entire New Testament and can find in it no guidance on how Christians should live as a majority.
#+end_quote




