docs/posts/2015-12-09-religion-and-culture.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 14, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Religion and Culture</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Religion and Culture</h1>
<p class="subtitle" role="doc-subtitle">Dec 09, 2015</p>
</header><p>
<a href="http://www.booksandculture.com/articles/webexclusives/2015/december/paris-and-beyond.html?utm_source=booksandculture-html&amp;utm_medium=Newsletter&amp;utm_term=11172719&amp;utm_content=401372051&amp;utm_campaign=2013">Philip Yancey</a> relates an insightful comment by a Muslim scholar explaining the particular difficulties that Islam and Christianity each have relating to culture:
</p>

<blockquote>
<p>
I have read the entire Koran and can find in it no guidance on how Muslims should live as a minority in a society. I have read the entire New Testament and can find in it no guidance on how Christians should live as a majority.
</p>
</blockquote>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 14, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
